### WINDOW FUNCITON

### RANK OVER

In [ ]:
SELECT *,DENSE_RANK() OVER(ORDER BY Salary DESC) AS rank FROM Employee
#rank this column doesn't come with the table at the same time, which means:
#can not use where 'rank'=1 directly below this query

# 可以先rank，在select subset of the columns
SELECT score, DENSE_RANK() OVER(ORDER BY Score DESC) AS Rank FROM Scores

In [ ]:
DENSE_RANK() OVER(ORDER BY Salary DESC) #111 2
RANK() OVER(ORDER BY Salary DESC) #111 4
ROW_NUMBER() OVER(ORDER BY Salary DESC) #1234

In [ ]:
PERCENT_RANK() OVER(ORDER BY )

In [ ]:
#PARTITION BY
SELECT e.Name AS Employee, e.Salary AS Salary,d.Name AS Department, 
 DENSE_RANK() OVER(PARTITION BY e.DepartmentId ORDER BY e.Salary DESC) AS rank FROM Employee e

### CASE WHEN

In [ ]:
SELECT
CASE
    WHEN id%2=0 THEN id-1
    WHEN id=(SELECT COUNT(*) FROM seat) THEN id
    ELSE id+1
END id #只对id 这一列操作
,student FROM seat
ORDER BY id
#generate the column when searching at the same time

In [ ]:
SELECT 
CASE 
    WHEN A=B AND B=C THEN 'Equilateral'
    WHEN A+B<=C OR B+C<=A OR A+C<=B THEN 'Not A Triangle'
    WHEN A+B>C AND B+C>A AND A+C>B AND A!=B AND B!=C AND C!=A THEN 'Scalene'
    ELSE 'Isosceles'
END AS Result
FROM TRIANGLES

### CHANGE WITH DATE FORMAT(2019/9/12)

In [ ]:
#USE DATEDIFF()
SELECT w1.Id FROM Weather w1 LEFT JOIN Weather w2 
ON DATEDIFF(Day,w2.RecordDate,w1.RecordDate)=1 #w1-w2
WHERE w1.Temperature>w2.Temperature

### SELECT TABLE ALIAS

In [2]:
#Format
#SELECT T1.Name FROM (SELECT NAME,RANK()OVER(ORDER BY SCORE DESC) rank FROM TABLE1) AS T1

In [ ]:
SELECT * FROM
(SELECT Name,ROW_NUMBER() OVER(ORDER BY Name) AS Row FROM OCCUPATIONS
WHERE Occupation='Doctor') AS d,
(SELECT Name,ROW_NUMBER() OVER(ORDER BY Name) AS Row FROM OCCUPATIONS
WHERE Occupation='Professor') AS p

### MULTPLE JOIN

In [ ]:
#Join consecutively
SELECT*FROM a
JOIN b ON a.Id=b.Id 
Join c ON b.Id=c.Id
a--b--c
reference:https://www.interfacett.com/blogs/multiple-joins-work-just-like-single-joins/

In [ ]:
SELECT d.Name,p.Name,s.Name,a.Name FROM
(SELECT Name,ROW_NUMBER() OVER(ORDER BY Name) AS Row FROM OCCUPATIONS
WHERE Occupation='Doctor') AS d
FULL OUTER JOIN 
(SELECT Name,ROW_NUMBER() OVER(ORDER BY Name) AS Row FROM OCCUPATIONS
WHERE Occupation='Professor') AS p
ON d.Row=p.Row
FULL OUTER JOIN 
(SELECT Name,ROW_NUMBER() OVER(ORDER BY Name) AS Row FROM OCCUPATIONS
WHERE Occupation='Singer') AS s
ON p.Row=s.Row
FULL OUTER JOIN 
(SELECT Name,ROW_NUMBER() OVER(ORDER BY Name) AS Row FROM OCCUPATIONS
WHERE Occupation='Actor') AS a
ON s.Row=a.Row

### MAX-MIN

In [ ]:
SELECT (MAX(POPULATION)-MIN(POPULATION)) a FROM CITY#can be done in one step

### MEDIAN

In [ ]:
SELECT DISTINCT PERCENTILE_CONT(0.5) WITHIN GROUP (ORDER BY LAT_N) OVER () FROM STATION 
#if you want to get percentile in a subgroup you can do partition by in over clause

### REMOVE 0 IN NUMBERS

In [ ]:
SELECT DISTINCT
CEILING(AVG(Salary)-
AVG(CAST(REPLACE(STR(Salary),'0','') AS INT)) )+1
FROM EMPLOYEES
#CEILING ROUND TO LOWEST INTERGER

### TIME STAMP

In [ ]:
#SELECT id FROM TABLE WHERE YEAR(FROM_UNIXTIME(creation_date)) = 2010
YEAR(CAST(timestamp AS DATE))=2018

### MULTIPLY 1 COLUMN TO ANOTHER& SUBQUERY FROM A TEMPORARY TABLE

In [ ]:
SELECT* FROM
(SELECT (months*salary) AS earnings,DENSE_RANK() OVER(ORDER BY months*salary DESC) rank FROM Employee) AS T

### ROUNDS TO 2 DECIMAL

In [ ]:
SELECT CONVERT(DECIMAL(10,2),SUM(LAT_N)) FROM table1#123.45

ROUND(AVG(c1.POPULATION),1)#round to nearest integer

### TOP 10 PERCENT

In [ ]:
SELECT NTILE(10) OVER(ORDER BY ID) FROM STATION